import SVerLean.Lectures.lecture_8
import SVerLean.Lectures.lecture_9
import Mathlib

set_option linter.style.longLine false

open Classical

/- # Задача 1. Размотка циклов

Иногда компиляторы для оптимизации разворачивают короткие циклы. Например, цикл
```py
for i in range(3):
  sum += i
```
можно развернуть в
```py
sum += 0
sum += 1
sum += 2
```
(дальнейшие оптимизации могут это сжать до `sum += 6`)

Так экономится несколько инструкций: обновление переменной цикла,
переход в начало цикла, проверка условия, и т.п.

Самое главное при оптимизациях -- не изменить поведение программы.
В этой задаче предлагается реализовать размотку циклов для языка WHILE
и доказать что полученная программа эквивалентна исходной.
-/

/-- Цикл for в языке WHILE. Мы будем разматывать только их. -/
def Stmt.for (i : String) (start stop : ℕ) (body : Stmt) : Stmt :=
  .assign i start;
  .whileDo (fun s => s i < stop) (
    body;
    .assign i (fun s => s i + 1)
  )

/-- Напишите размотанную версию цикла for выше. -/
def Stmt.unrolledFor (i : String) (start stop : ℕ) (body : Stmt) : Stmt :=
  sorry

/-- Нам понадобится вспомогательное условие, что тело цикла не меняет
значение счетчика `i`. -/
def PreservesCounter (i : String) (body : Stmt) : Prop :=
  ∀ val, {fun s ↦ s i = val}body{fun s ↦ s i = val}

-- пригодится дальше. Кроме того таким образом можно доказывать и многие другие вспомогательные
-- утверждения
theorem seq_assoc (A B C : Stmt) :
    (A; B); C ≈ A; (B; C) := by
  simp [Stmt.equiv_def, DenoteEquiv, SetRel.comp]
  grind

theorem assign_if_true_equiv (x : String) (val : ℕ) (B : ℕ → Bool) (S T : Stmt) (h : B val) :
    (.assign x (fun _ ↦ val); .ifThenElse (fun s => B (s x)) S T) ≈ (.assign x (fun _ ↦ val); S) := by
  sorry

theorem assign_if_false_equiv (x : String) (val : ℕ) (B : ℕ → Bool) (S T : Stmt) (h : ¬ B val) :
    (.assign x (fun _ ↦ val); .ifThenElse (fun s => B (s x)) S T) ≈ (.assign x (fun _ ↦ val); T) := by
  sorry

/-- Докажите что размотка цикла сохраняет семантику.

Подсказка: пользуйтесь леммами выше. При необходимости можно ввести и другие.
В авторском решении используются только эти и те что были в лекции.

Подсказка 2: для того чтобы использовать условие `PreservesCounter i body` переведите
его с языка троек Хоара на язык денотационной семантики при помощи `denote_Iff_BigStep`
-/
theorem unrolledFor_correct (i : String) (start stop : ℕ) (body : Stmt)
    (h : PreservesCounter i body) :
    ⟦Stmt.for i start stop body⟧ = ⟦Stmt.unrolledFor i start stop body⟧ := by
  sorry


/- # Задача 2. Недетерминизм.

Денотационная семантика позволяет естественно описать недетерминированные программы.

Недетерминизм бывает разный. В этой задаче мы рассмотрим три варианта семантики для
недетерминированных программ.
-/

namespace Problem2

/-- `Nondet α` означает недетерминированное вычисление типа `α`. -/
inductive Nondet (α : Type) : Type
  /-- Детерминированное вычисление в `α`. -/
  | just   : α → Nondet α
  /-- Неудачное вычисление. -/
  | fail   : Nondet α
  /-- Ветвление: `f : Bool → Nondet α` выдает вычисление для каждой ветви.
  В данном случае их две: `f true` и `f false`. Но можно заменить `Bool` на другой тип. -/
  | choice : (Bool → Nondet α) → Nondet α

/-- Семантика №1: вычисление множества значений. Будем считать что дерево вычислений
`nondet : Nondet α` "вычисляется" во множество результатов для каждого узла дерева.
Напишите функцию которая вычисляет результат вычисления программы типа `Nondet α`. -/
def Nondet.denote {α} (nondet : Nondet α) : Set α :=
  sorry

/-- Семантика №2: знаменитый сложностной класс NP (Non-deterministic Polynomial time)
можно задать как класс задач распознавания (т.е. с ответом да/нет)
которые можно решить за полиномиальное время на недетерминированной машине Тьюринга.
Считается что машина отвечает "да" если хоть в одной ветви вычисления получается "да".
Напишите функцию которая вычисляет результат вычисления программы типа `Nondet Bool`,
соответсвующий описанию выше. -/
def Nondet.denoteNP (nondet : Nondet Bool) : Bool :=
  sorry
-- P.S. В зеркальном случае (машина отвечает "нет" если хоть в одной ветви
-- вычисления получается "нет") мы получили бы класс coNP.

/-- Напишите функцию которая проверяет выполнима ли формула φ, то есть
существует ли набор `(x, y, z)` такой что `φ(x, y, z) = true`. -/
def checkSat3 (φ : Bool → Bool → Bool → Bool) : Nondet Bool :=
  sorry

example (φ) : (checkSat3 φ).denoteNP = true ↔ ∃ x y z, φ x y z = true := by
  sorry

/- **Бонус**: обобщите это на фукнцию от `n` булевых переменных.
Возможно к этому стоит вернуться когда мы пройдем монады.-/

/-- Семантика №3: вероятностное вычисление. Теперь мы считает что в каждом ветвлении
мы с вероятностью 1/2 выбираем одну из ветвей. Тогда программа типа `Nondet α`
интерпретируется как случайная величина типа `α`. Напишите функцию которая
вычисляет вероятность того что результат будет равен `res`. -/
noncomputable def Nondet.denoteProb {α} (nondet : Nondet α) (res : α) : ℝ :=
  sorry

/-- Возвращает случайный `Bool`. -/
def randBool : Nondet Bool :=
  .choice (fun b => .just b)

/-- Напишите функцию которая выдает 0, 1 или 2 с вероятностью 1/4, а с вероятностью 1/4
возвращает fail. -/
def randThree : Nondet (Fin 3) :=
  sorry

example : randThree.denoteProb 0 = 1/4 := by
  sorry

/-- **Бонус**: реализуйте функцию `amplify` которая запускает вероятностное вычисление
максимум `n` раз до первого успешного результата и возвращает этот результат.
Подсказка: тут не обойтись без вспомогательной функции.
Возможно к этому стоит вернуться когда мы пройдем монады. -/
def amplify {α} (f : Nondet α) (n : ℕ) : Nondet α :=
  sorry

/-- Амплификация позволяет сэмплировать `Fin 3` почти равномерно. -/
example (i : Fin 3) : (amplify randThree 5).denoteProb i ≥ 1/3 - 0.01 := by
  sorry


end Problem2

/- # Бонус. Рекурсивные функции как неподвижные точки

Функция является рекурсивной если её тело ссылается на эту же функцию. В общем виде это можно
записать так:
`f (x : α) : β := F f x`
где `F : (α → β) → α → β` - оператор, который принимает функцию и аргумент и возвращает результат.

Например для факториала:
`fact (n : ℕ) : ℕ := if n = 0 then 1 else n * fact (n - 1)`
можно записать `fact n := F fact n` где
`F (f : ℕ → ℕ) (n : ℕ) : ℕ := if n = 0 then 1 else n * f (n - 1)`

Уравнение выше можно упростить до `f = F f`. Получатся обычное уравнение неподвижной точки.
Нетривиальной задачей является проверка что для данного `F` это уравнение имеет решение.

Теорема Кнастера-Тарского здесь не поможет, потому что `ℕ → ℕ` не является полной решеткой.

В этой задаче мы используем теорему Клини о неподвижной точке для доказательства существования
рекурсивных частичных функций. "Частичная" означает что функция может не завершаться для всех
аргументов. Формально мы рассмотрим функции со значениями в `Option ℕ` и будем считать что функция
возвращает `none` если она не завершается.
-/

namespace Problem3

/-
Сформулируем теорему Клини о неподвижной точке.
1. Пусть `X` - частично упорядоченное множество, которое к тому же ω-полно: то есть у для любой
счетной цепочки `x₁ ≤ x₂ ≤ x₃ ≤ ...` существует точная верхняя грань.
2. Пусть `f : X → X` - монотонная функция сохраняющая супремумы цепочек (то есть для любой
цепи `x₁ ≤ x₂ ≤ x₃ ≤ ...` выполняется `f (⨆ i, x i) = ⨆ i, f (x i)`).
3. Пусть `x₀ ∈ X` (начальное значение) таково что `x₀ ≤ f x₀`.

Тогда супремум цепочки `x₀ ≤ f x₀ ≤ f (f x₀) ≤ ...` является неподвижной точкой функции `f`.

P.S.: примерно так работает `partial_fixpoint` в Lean.
Подробнее можно прочитать тут:
https://lean-lang.org/doc/reference/latest/Definitions/Recursive-Definitions/#partial-fixpoint
-/

open OmegaCompletePartialOrder fixedPoints

/- Первое что мы сделаем это определим ω-полный частичный порядок на `Option α`. -/

instance (α : Type) : PartialOrder (Option α) where
  le x y := x = y ∨ x = none -- `none` меньше любого элемента, а все остальные несравнимы
  le_refl a := by simp
  le_trans a b c := by grind
  le_antisymm a b := by grind

/- Выключим стандартные инстансы для порядка на `Option`. Порядок который мы введем
будет отличаться от них, и Lean может неверно трактовать `x ≤ y` используя
станадртный порядок, когда мы имеем в виду наш. -/
attribute [-instance] instLEOption
attribute [-instance] instLTOption

@[simp]
lemma none_le {α : Type} (x : Option α) : none ≤ x := by
  right
  rfl

noncomputable instance (α : Type) : OmegaCompletePartialOrder (Option α) where
  ωSup c :=
    if h : ∃ i, (c i).isSome then
      c (Nat.find h)
    else
      none
  le_ωSup c i := by
    sorry -- подсказка: как выглядят цепочки в `Option α`?
  ωSup_le c x hx := by
    sorry

/- Теперь применим теорему Клини чтоб определить конкретные функции. -/

noncomputable def Fib : (ℕ → Option ℕ) →𝒄 (ℕ → Option ℕ) where
  toFun f n :=
    match n with
    | 0 => some 0
    | 1 => some 1
    | m + 2 =>
      match f m, f (m + 1) with
      | some a, some b => some (a + b)
      | _, _ => none
  monotone' := by
    sorry
  map_ωSup' c := by
    sorry

/-- Теперь можно определить `fib` как неподвижную точку функции `Fib`. -/
noncomputable def fib := ωSup <| iterateChain Fib.toOrderHom (fun _ ↦ none) (by intro i; simp)

theorem fib_rec (n : ℕ) : (fib n) = Fib fib n := by
  -- `ωSup_iterate_mem_fixedPoint` это теорема Клини
  have : fib ∈ Function.fixedPoints Fib := ωSup_iterate_mem_fixedPoint _ _ _
  simp [Function.fixedPoints] at this
  rw [this]

example : fib 0 = some 0 := by
  rw [fib_rec]
  simp [Fib]

example : (fib 5) = some 5 := by
  repeat (rw [fib_rec]; simp [Fib])

/- Теперь докажем существование функции `loop` с рекурсивным определением
`loop n := loop (n + 1)`
-/

noncomputable def Loop : (ℕ → Option ℕ) →𝒄 (ℕ → Option ℕ) where
  toFun f n := f (n + 1)
  monotone' := by
    sorry
  map_ωSup' c := by
    sorry

noncomputable def loop := ωSup <| iterateChain Loop.toOrderHom (fun _ ↦ none) (by intro i; simp)

theorem loop_rec (n : ℕ) : (loop n) = loop (n + 1) := by
  sorry

/- Вопрос на засыпку: придумайте монотонное отображение из `ℕ → Option ℕ` в себя которое не
сохраняет супремумы цепей. -/

end Problem3
